# DummyHostMustBePerpendicularToXY Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..DummyHostMustBePerpendicularToXY Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Dummy host must be perpendicular to Z or Y axis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DummyHostMustBePerpendicularToXY { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DummyHostMustBePerpendicularToXY As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DummyHostMustBePerpendicularToXY {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace